#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.github_repos.github_repository.repo_creation[0]: Refreshing state... [id=escape-room-revamp-api]
module.github_repos.github_repository_collaborator.brendon_admin[0]: Refreshing state... [id=escape-room-revamp-api:BrendonLH]
module.github_repos.github_repository_collaborator.jin_admin[0]: Refreshing state... [id=escape-room-revamp-api:jinwoov]
module.github_repos.github_branch_protection_v3.repo_governance[0]: Refreshing state... [id=escape-room-revamp-api:main]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_admin_team.github_team.team_jab will be created
  + resource "github_team" "team_jab" {
      + create_default_maintainer = false
      + description               = "Jab jab hook"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "teamjab_admin"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.github_admin_team.github_team_members.add_team_to_group will be created
  + resource "github_team_members" "add_team_to_group" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "BrendonLH"
        }
      + members {
          + role     = "maintainer"
          + username = "jinwoov"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jinwoov, Action: `pull_request`, Working Directory: ``, Workflow: `tf_deploy`*